Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.ExactSpacing.Element.Number Property
 Gets or sets the number of spaces in the element.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Number { get; set; }
Public Property Number As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RebarSpacing.ExactSpacing.Element Structure
Tekla.Structures.Model Namespace